---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSetIterator.#ctor
source: html/816dd9c9-8087-dea0-e116-f1b3ea90b36e.htm
---
# Autodesk.Revit.DB.Visual.AssetSetIterator.#ctor Method

Initializes a new instance of the AssetSetIterator class

## Syntax (C#)
```csharp
public AssetSetIterator()
```